config/Documents/ОтчетАптекиКомиссионера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ОтчетАптекиКомиссионера</Name>
			<Comment>Для списания товара с дублирующего склада</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДисконтныеКарты</xr:Item>
				<xr:Item>AccumulationRegister.ПартииЖНВЛС</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиПоСтНДСПоСкладам</xr:Item>
				<xr:Item>AccumulationRegister.ДисконтПоПартиям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФирмаКомиссионер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомиссионер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Comment>В закупочных ценах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗакуп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товар</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакуп</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДСЗакуп</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Дисконт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Карта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/AccumulationRegisters/ПартииЖНВЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииЖНВЛС</Name>
			<Comment>Учет по партиям товаров</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Колво</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗакупСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСЗакуп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРознСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРознНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

config/AccumulationRegisters/ДисконтПоПартиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ДисконтПоПартиям</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Колво</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСоСкидкой</Name>
					<Comment>розничная</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Если сложить с суммой со скидкой получим полную розничную сумму</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерЧека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерДК</Name>
					<Comment>Код ДК без контрольной суммы первые 12 цифр</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

config/AccumulationRegisters/ДисконтныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ДисконтныеКарты</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаРознСоСк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Колво</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерДК</Name>
					<Comment>Код ДК без контрольной суммы первые 12 цифр</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

config/Enums/ВидыПоступленияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыПоступленияТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комиссия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусныйТовар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подарки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/Documents/ОтчетАптекиКомиссионера/Ext/ObjectModule.bsl
Процедура МО_ЗаполнитьОтчетКомиссионера(ДокОбъект) Экспорт
	
	Если ДокОбъект.ЭтоНовый()=Истина ТОгда
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;	
	
	
	
	Запрос=Новый Запрос( "ВЫБРАТЬ
	                     |	ПартииЖНВЛСОбороты.Товар,
	                     |	ПартииЖНВЛСОбороты.Склад,
	                     |	ПартииЖНВЛСОбороты.Партия,
	                     |	ПартииЖНВЛСОбороты.Партия.ПартияРодитель КАК ПартияКомитента,
	                     |	ПартииЖНВЛСОбороты.Фирма,
	                     |	ПартииЖНВЛСОбороты.СтавкаНДС,
	                     |	ПартииЖНВЛСОбороты.Партия.Поставщик,
	                     |	СУММА(ПартииЖНВЛСОбороты.КолвоРасход) КАК КолвоРасход,
	                     |	СУММА(ПартииЖНВЛСОбороты.СуммаЗакупСНДСРасход) КАК Закуп,
	                     |	СУММА(ПартииЖНВЛСОбороты.СуммаНДСЗакупРасход) КАК ЗакупНДС,
	                     |	СУММА(ПартииЖНВЛСОбороты.СуммаРознСНДСРасход) КАК Розн,
	                     |	СУММА(ПартииЖНВЛСОбороты.СуммаРознНДСРасход) КАК РознНДС
	                     |ПОМЕСТИТЬ РеализацияКомиссионера
	                     |ИЗ
	                     |	РегистрНакопления.ПартииЖНВЛС.Обороты(
	                     |			&Дата1,
	                     |			&Дата2,
	                     |			Регистратор,
	                     |			Фирма = &ФирмаКомиссионер
	                     |				И Склад = &СкладКомиссионер
	                     |				И Партия.ВидПоступленияТовара = &ВПТ_Комиссия
	                     |				И Партия.Поставщик = &ФирмаКомитентКакПоставщик) КАК ПартииЖНВЛСОбороты
	                     |ГДЕ
	                     |	ПартииЖНВЛСОбороты.Регистратор ССЫЛКА Документ.РеализацияККМ
	                     |
	                     |СГРУППИРОВАТЬ ПО
	                     |	ПартииЖНВЛСОбороты.Товар,
	                     |	ПартииЖНВЛСОбороты.Склад,
	                     |	ПартииЖНВЛСОбороты.Партия,
	                     |	ПартииЖНВЛСОбороты.Партия.ПартияРодитель,
	                     |	ПартииЖНВЛСОбороты.Фирма,
	                     |	ПартииЖНВЛСОбороты.СтавкаНДС,
	                     |	ПартииЖНВЛСОбороты.Партия.Поставщик
	                     |;
	                     |
	                     |////////////////////////////////////////////////////////////////////////////////
	                     |ВЫБРАТЬ
	                     |	ПартииЖНВЛСОстатки.Партия КАК ПартияКомитента,
	                     |	ПартииЖНВЛСОстатки.КолвоОстаток,
	                     |	ПартииЖНВЛСОстатки.СуммаЗакупСНДСОстаток КАК Закуп,
	                     |	ПартииЖНВЛСОстатки.СуммаНДСЗакупОстаток КАК ЗакупНДС,
	                     |	ПартииЖНВЛСОстатки.СуммаРознСНДСОстаток КАК Розн,
	                     |	ПартииЖНВЛСОстатки.СуммаРознНДСОстаток КАК РознНДС
	                     |ПОМЕСТИТЬ ОстаткиКомитента
	                     |ИЗ
	                     |	РегистрНакопления.ПартииЖНВЛС.Остатки(
	                     |			&Дата2,
	                     |			Фирма = &ФирмаКомитент
	                     |				И Склад = &СкладКомитент) КАК ПартииЖНВЛСОстатки
	                     |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеализацияКомиссионера КАК Исх
	                     |		ПО ПартииЖНВЛСОстатки.Партия = Исх.ПартияКомитента
	                     |;
	                     |
	                     |////////////////////////////////////////////////////////////////////////////////
	                     |ВЫБРАТЬ
	                     |	РеализацияКомиссионера.Товар,
	                     |	РеализацияКомиссионера.Склад,
	                     |	РеализацияКомиссионера.Партия,
	                     |	РеализацияКомиссионера.ПартияКомитента,
	                     |	РеализацияКомиссионера.Фирма,
	                     |	РеализацияКомиссионера.СтавкаНДС,
	                     |	РеализацияКомиссионера.ПартияПоставщик,
	                     |	РеализацияКомиссионера.КолвоРасход,
	                     |	РеализацияКомиссионера.Закуп,
	                     |	РеализацияКомиссионера.ЗакупНДС,
	                     |	РеализацияКомиссионера.Розн,
	                     |	РеализацияКомиссионера.РознНДС,
	                     |	ВЫБОР
	                     |		КОГДА РеализацияКомиссионера.КолвоРасход < ОстаткиКомитента.КолвоОстаток
	                     |			ТОГДА ВЫРАЗИТЬ(ОстаткиКомитента.Розн / ОстаткиКомитента.КолвоОстаток * РеализацияКомиссионера.КолвоРасход КАК ЧИСЛО(15, 2))
	                     |		ИНАЧЕ ОстаткиКомитента.Розн
	                     |	КОНЕЦ КАК РознРасходКомитента,
	                     |	ВЫБОР
	                     |		КОГДА РеализацияКомиссионера.КолвоРасход < ОстаткиКомитента.КолвоОстаток
	                     |			ТОГДА ВЫРАЗИТЬ(ОстаткиКомитента.РознНДС / ОстаткиКомитента.КолвоОстаток * РеализацияКомиссионера.КолвоРасход КАК ЧИСЛО(15, 2))
	                     |		ИНАЧЕ ОстаткиКомитента.РознНДС
	                     |	КОНЕЦ КАК РознНДСРасходКомитента
	                     |ПОМЕСТИТЬ РасходКомитента
	                     |ИЗ
	                     |	РеализацияКомиссионера КАК РеализацияКомиссионера
	                     |		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиКомитента КАК ОстаткиКомитента
	                     |		ПО РеализацияКомиссионера.ПартияКомитента = ОстаткиКомитента.ПартияКомитента
	                     |;
	                     |
	                     |////////////////////////////////////////////////////////////////////////////////
	                     |ВЫБРАТЬ
	                     |	РасходКомитента.Товар,
	                     |	РасходКомитента.Склад,
	                     |	РасходКомитента.Партия,
	                     |	РасходКомитента.ПартияКомитента,
	                     |	РасходКомитента.Фирма,
	                     |	РасходКомитента.СтавкаНДС,
	                     |	РасходКомитента.КолвоРасход КАК Количество,
	                     |	РасходКомитента.Закуп КАК СуммаЗакуп,
	                     |	РасходКомитента.ЗакупНДС КАК НДСЗакуп,
	                     |	РасходКомитента.РознРасходКомитента - РасходКомитента.Розн КАК СуммаСкидки,
	                     |	РасходКомитента.РознРасходКомитента КАК Сумма,
	                     |	РасходКомитента.РознНДСРасходКомитента КАК СуммаНДС,
	                     |	РасходКомитента.Розн,
	                     |	РасходКомитента.РознНДС
	                     |ПОМЕСТИТЬ ДляЗагрузки
	                     |ИЗ
	                     |	РасходКомитента КАК РасходКомитента
	                     |;
	                     |
	                     |////////////////////////////////////////////////////////////////////////////////
	                     |УНИЧТОЖИТЬ РеализацияКомиссионера
	                     |;
	                     |
	                     |////////////////////////////////////////////////////////////////////////////////
	                     |УНИЧТОЖИТЬ ОстаткиКомитента
	                     |;
	                     |
	                     |////////////////////////////////////////////////////////////////////////////////
	                     |УНИЧТОЖИТЬ РасходКомитента
	                     |;
	                     |
	                     |////////////////////////////////////////////////////////////////////////////////
	                     |ВЫБРАТЬ
	                     |	ДляЗагрузки.Товар,
	                     |	ДляЗагрузки.ПартияКомитента КАК Партия,
	                     |	ДляЗагрузки.Количество,
	                     |	ДляЗагрузки.СуммаСкидки,
	                     |	ДляЗагрузки.Сумма - ДляЗагрузки.СуммаСкидки КАК СуммаСоСкидкой,
	                     |	""Переоценка"" КАК Карта,
	                     |	ДляЗагрузки.СтавкаНДС
	                     |ИЗ
	                     |	ДляЗагрузки КАК ДляЗагрузки
	                     |ГДЕ
	                     |	ДляЗагрузки.СуммаСкидки <> 0
	                     |;
	                     |
	                     |////////////////////////////////////////////////////////////////////////////////
	                     |ВЫБРАТЬ
	                     |	ДляЗагрузки.Товар,
	                     |	ДляЗагрузки.Склад,
	                     |	ДляЗагрузки.ПартияКомитента КАК Партия,
	                     |	ДляЗагрузки.Фирма,
	                     |	ДляЗагрузки.СтавкаНДС,
	                     |	ДляЗагрузки.Количество,
	                     |	ДляЗагрузки.СуммаЗакуп,
	                     |	ДляЗагрузки.НДСЗакуп,
	                     |	ДляЗагрузки.СуммаСкидки,
	                     |	ДляЗагрузки.Сумма,
	                     |	ДляЗагрузки.СуммаНДС,
	                     |	ДляЗагрузки.Розн,
	                     |	ДляЗагрузки.РознНДС
	                     |ИЗ
	                     |	ДляЗагрузки КАК ДляЗагрузки
	                     |;
	                     |
	                     |////////////////////////////////////////////////////////////////////////////////
	                     |УНИЧТОЖИТЬ ДляЗагрузки");
	
 Запрос.УстановитьПараметр("Дата1",НачалоДня(ДокОбъект.НачПериода));
 Запрос.УстановитьПараметр("Дата2",КонецДня(ДокОбъект.КонПериода));
 Запрос.УстановитьПараметр("ФирмаКомиссионер",ДокОбъект.ФирмаКомиссионер);
 Запрос.УстановитьПараметр("СкладКомиссионер",ДокОбъект.СкладКомиссионер);
 Запрос.УстановитьПараметр("ВПТ_Комиссия",Перечисления.ВидыПоступленияТоваров.Комиссия);
 Запрос.УстановитьПараметр("ФирмаКомитентКакКомиссионер",ДокОбъект.Фирма.ФирмаКакПоставщик);
 
 Запрос.УстановитьПараметр("ФирмаКомитентКакПоставщик",ДокОбъект.Фирма.ФирмаКакПоставщик);
 Запрос.УстановитьПараметр("ФирмаКомитент",ДокОбъект.Фирма);
 Запрос.УстановитьПараметр("СкладКомитент",ДокОбъект.Склад);
 
 РезМассив=Запрос.ВыполнитьПакет();
 
 РезДисконт=РезМассив.Получить(7).Выгрузить();
 РезТовар=РезМассив.Получить(8).Выгрузить();
	
	ДокОбъект.Товар.Загрузить(РезТовар);
	ДокОбъект.Дисконт.Загрузить(РезДисконт);
КонецПроцедуры	


Функция ПодготовитьТабДвиженийТовара()
	
	ТЗ=Товар.Выгрузить();
	
	ТЗ.Колонки.Добавить("Активность");
	ТЗ.Колонки.Добавить("ВидДвижения");
	ТЗ.Колонки.Добавить("ВидОперации");
	ТЗ.Колонки.Добавить("Регистратор");
	ТЗ.Колонки.Добавить("Склад");
	ТЗ.Колонки.Добавить("Фирма");
	ТЗ.Колонки.Добавить("Период");
	
	ТЗ.Колонки.Найти("Количество").Имя= "Колво";
	ТЗ.Колонки.Найти("СуммаЗакуп").Имя= "СуммаЗакупСНДС";
    ТЗ.Колонки.Найти("НДСЗакуп")  .Имя= "СуммаНДСЗакуп";
    ТЗ.Колонки.Найти("Сумма")     .Имя= "СуммаРознСНДС";
    ТЗ.Колонки.Найти("СуммаНДС")  .Имя= "СуммаРознНДС";
 	
    ТЗ.ЗаполнитьЗначения(Истина,"Активность");
	ТЗ.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход ,"ВидДвижения" );
	ТЗ.ЗаполнитьЗначения(Перечисления.ВидыОпераций.ОтчетКомиссионера,"ВидОперации");
	ТЗ.ЗаполнитьЗначения(ЭтотОбъект.Ссылка,"Регистратор");
	ТЗ.ЗаполнитьЗначения(Склад,"Склад");
	ТЗ.ЗаполнитьЗначения(Фирма,"Фирма");
	ТЗ.ЗаполнитьЗначения(Дата,"Период");

    Возврат ТЗ;
	
КонецФункции	

Функция ПодготовитьТабДвиженийДисконта()
	ТЗ=Дисконт.Выгрузить();
	
	ТЗ.Колонки.Добавить("Активность");
	ТЗ.Колонки.Добавить("ВидОперации");
	ТЗ.Колонки.Добавить("Регистратор");
	ТЗ.Колонки.Добавить("Склад");
	ТЗ.Колонки.Добавить("Фирма");
	ТЗ.Колонки.Добавить("Период");
	
	ТЗ.Колонки.Найти("Количество").Имя= "Колво";
	ТЗ.Колонки.Найти("Карта").Имя= "НомерДК";
    	
    ТЗ.ЗаполнитьЗначения(Истина,"Активность");
	ТЗ.ЗаполнитьЗначения(ЭтотОбъект.Ссылка,"Регистратор");
	ТЗ.ЗаполнитьЗначения(Склад,"Склад");
	ТЗ.ЗаполнитьЗначения(Фирма,"Фирма");
	ТЗ.ЗаполнитьЗначения(Дата,"Период");

	Возврат ТЗ;
КонецФункции


Процедура ЗаполнитьДвиженияДисконтныхКарт()
	
	 ТЗ=ДВижения.ДисконтПоПартиям.Выгрузить();
	 ТЗ.Свернуть("период,Товар,НомерДК","СуммаСоСкидкой,СуммаСкидки,Колво");
	 
	 ТЗ.Колонки.Найти("СуммаСоСкидкой").Имя="СуммаРознСоСк";
	 
	 Движения.ДисконтныеКарты.Загрузить(ТЗ);
	
	
КонецПроцедуры	



Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Для Каждого Дв Из ЭтотОбъект.Движения Цикл
		Дв.Очистить();
	КонецЦикла;

	
	
	//---------------<Списать остаток со склада комитента и записать данные по дисконту если таковой был>---------------------------// GtG // 31.05.2012 11:31:01
	Движения.ПартииЖНВЛС.Загрузить(ПодготовитьТабДвиженийТовара());	
	Движения.ДисконтПоПартиям.Загрузить(ПодготовитьТабДвиженийДисконта());	
    ОМ12_КопияДвиженийПартийВРегистрПоСтавкамНДС(ЭтотОбъект,Движения.ПартииЖНВЛС.Выгрузить());
	ЗаполнитьДвиженияДисконтныхКарт();
	Движения.ПартииЖНВЛС.Записать();
	Движения.ДисконтПоПартиям.Записать();
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Сумма=Товар.Итог("Сумма")-Дисконт.Итог("СуммаСкидки");
	СуммаЗакуп=Товар.Итог("СуммаЗакуп");
КонецПроцедуры
